{
  "backend/main.mo": "Actor storing user profiles and per-user level progress with access control checks and helpers for saving and retrieving level state.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files for reference.",
  "frontend/index.css": "Tailwind base setup defining light/dark theme CSS variables and applying global styles.",
  "frontend/index.html": "Base HTML document loading the PWA manifest, icons, and React entry point.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, colors, and launch behavior.",
  "frontend/public/sw.js": "Service worker handling versioned precaching, runtime caching, and network-first strategies for key PWA assets.",
  "frontend/src/App.tsx": "Main React app managing identity, password flow, event navigation, and game state across events.",
  "frontend/src/components/decor/RomanticDecor.tsx": "UI component rendering floating hearts, flowers, and teddies decorations based on chosen variant.",
  "frontend/src/components/layout/PortraitFrame.tsx": "Layout wrapper adding a patterned background and optional PWA install banner plus dev diagnostics.",
  "frontend/src/components/layout/PostUnlockHeader.tsx": "Displays a decorative romantic header with logo, hearts, gradients, and subtitle.",
  "frontend/src/components/pwa/InstallBanner.tsx": "Shows a bottom banner prompting PWA installation with platform‑specific instructions and dismiss/help controls.",
  "frontend/src/components/pwa/InstallHeartButton.tsx": "Heart‑shaped button that triggers PWA install flow with iOS help or fallback dialog when needed.",
  "frontend/src/components/pwa/InstallHelpDialog.tsx": "Multi‑tab dialog explaining how to install the PWA on Android, iOS, or desktop browsers.",
  "frontend/src/components/pwa/PwaDiagnosticsPanel.tsx": "Developer‑only panel showing PWA environment diagnostics such as installability and service worker state.",
  "frontend/src/components/quiz/SecretLetterReveal.tsx": "Handles reveal flow for secret letters, showing an animated prompt and then an image and message after reveal.",
  "frontend/src/game/assets/uploadedImages.ts": "Defines a list of uploaded image filenames and helpers returning level‑based or non‑repeating random asset paths.",
  "frontend/src/game/assets/winImageMapping.ts": "Re‑exports image utilities used for win or level image selection.",
  "frontend/src/game/constants.ts": "Contains game constants including password, total levels, and local‑storage key names.",
  "frontend/src/game/content/event3LoveLaughsJokes.ts": "Exports an array of themed romantic jokes grouped into letters for event 3.",
  "frontend/src/game/content/events.ts": "Defines event metadata and a helper to fetch events by ID.",
  "frontend/src/game/content/levelHints.ts": "Provides hint strings for 68 puzzle levels keyed by level number.",
  "frontend/src/game/content/loseMessages.ts": "Contains a list of comforting lose messages and a function returning a random one.",
  "frontend/src/game/content/winLetters.ts": "Defines win letters for levels, each with a love letter and a promise.",
  "frontend/src/game/levels/impl/FixedPuzzleLevel.tsx": "A complex generic puzzle component handling many interaction types and win/lose logic.",
  "frontend/src/game/levels/impl/Level001.tsx": "Implements a trick level where clicking the instruction wins and clicking the heart eventually loses.",
  "frontend/src/game/levels/impl/Level002.tsx": "Implements a drag interaction where moving the sun downward transitions to night and triggers a win.",
  "frontend/src/game/levels/impl/Level003.tsx": "A long-press puzzle where holding the mail icon for 1.5s opens it and triggers win, with failed short presses counting as attempts toward losing.",
  "frontend/src/game/levels/impl/levelConfigs.ts": "Defines level configuration objects mapping level numbers to instructions, solution types, and optional data parameters for levels 4–100.",
  "frontend/src/game/levels/levelRegistry.ts": "Returns the correct level component; levels 1–3 use custom components, while 4–100 wrap FixedPuzzleLevel with retrieved config.",
  "frontend/src/game/promisesKept/content/event4Levels.ts": "Contains detailed definitions for each Promises Kept level, including scenes, promises, actions, hints, and gameplay params.",
  "frontend/src/game/promisesKept/content/levelHints.ts": "Provides hint text for each Promises Kept level keyed by level number.",
  "frontend/src/game/promisesKept/content/loseMessages.ts": "Stores randomized lose messages and exports a function to return one at random.",
  "frontend/src/game/promisesKept/content/winLetters.ts": "Defines love and promise letters for each Promises Kept level and exports them in a numbered map.",
  "frontend/src/game/promisesKept/levels/impl/levelConfigs.ts": "Loads level data from event4 content and provides fallback configs for Promises Kept levels.",
  "frontend/src/game/promisesKept/levels/impl/PromisesKeptPuzzleLevel.tsx": "React component implementing many puzzle level behaviors using timers, animations, and config-based conditions.",
  "frontend/src/game/promisesKept/levels/levelRegistry.ts": "Maps a level number to a wrapped PromisesKeptPuzzleLevel component with its config.",
  "frontend/src/game/quiz/constants.ts": "Defines quiz constants such as total levels, questions per level and wrong-answer limit.",
  "frontend/src/game/quiz/content/quizLevels.ts": "Contains quiz level definitions, including questions, options, and a secret letter for each level.",
  "frontend/src/game/quiz/types.ts": "Defines TypeScript interfaces for quiz options, questions, and levels.",
  "frontend/src/game/storage/passwordGate.ts": "Handles password checking and locked/unlocked state using localStorage.",
  "frontend/src/game/storage/progressStorage.ts": "Manages core game progress with load, save, level complete, skipping, and reset using localStorage.",
  "frontend/src/game/storage/promisesKeptProgressStorage.ts": "Tracks Promises Kept mode progress with functions for loading, saving, completing, skipping, and resetting.",
  "frontend/src/game/storage/quizProgressStorage.ts": "Stores and updates quiz mode progress including completed levels and unlocking logic.",
  "frontend/src/game/storage/useProgress.ts": "React hook that syncs game progress with localStorage and backend actor, providing helpers to update levels.",
  "frontend/src/game/storage/usePromisesKeptProgress.ts": "React hook managing Promises Kept progress with backend sync, clamping, and level-completion utilities.",
  "frontend/src/game/storage/useQuizProgress.ts": "React hook managing quiz progress, syncing local state with backend actor and providing helpers for completing, skipping, and resetting levels.",
  "frontend/src/game/ui/levelBackground.ts": "Generates per‑level background gradients and accent colors based on level zones with varying overlay opacity.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s Internet Identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "React‑query hooks for fetching and updating user profiles and level progress through the backend actor.",
  "frontend/src/index.css": "Global Tailwind styles defining a romantic OKLCH color theme, animations, utilities, and dark‑mode variables.",
  "frontend/src/main.tsx": "Entry point setting up React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers and manages the service worker, logging lifecycle events and periodically checking for updates.",
  "frontend/src/pwa/usePwaInstall.ts": "React hook managing PWA install flow, including iOS checks, beforeinstallprompt handling, service worker status, and dismissal logic.",
  "frontend/src/screens/EventDetailScreen.tsx": "Displays details for a selected romantic event, routing to interactive event screens or showing a fallback letter view.",
  "frontend/src/screens/EventsHubScreen.tsx": "Renders the main events hub listing all events with icons, statuses, and click handling for navigation.",
  "frontend/src/screens/IntroScreen.tsx": "Empty file with no implementation.",
  "frontend/src/screens/LandingScreen.tsx": "Password‑locked landing screen with romantic theming, handling password validation and showing installation and decor elements.",
  "frontend/src/screens/LevelPlayScreen.tsx": "Controls level gameplay UI, choosing level components, backgrounds, hints, and handling navigation for two game types.",
  "frontend/src/screens/LoadingScreen.tsx": "Animated loading screen with a heart graphic and timed progress bar triggering completion callback.",
  "frontend/src/screens/LoseScreen.tsx": "Displays themed lose screens for two event types with shaking animation, random messages, and a retry button.",
  "frontend/src/screens/PasswordGateScreen.tsx": "Empty file with no implemented UI or logic.",
  "frontend/src/screens/QuizPlayScreen.tsx": "Implements full quiz gameplay flow including question progression, wrong-answer tracking, level completion, and loss handling.",
  "frontend/src/screens/romantic/DPBEventScreen.tsx": "Interactive romantic event where repeated 'No' increases 'Yes' button size, leading to a celebration screen and optional hidden letter view.",
  "frontend/src/screens/romantic/LoveLaughsEventScreen.tsx": "Displays a list of 10 letters containing jokes, each revealed in a modal with associated images and back navigation.",
  "frontend/src/screens/romantic/TogetherForeverEventScreen.tsx": "A romantic event screen where a “No” button moves randomly, and accepting shows a celebratory view with photos, decorations, and themed UI.",
  "frontend/src/screens/WinScreen.tsx": "Shows win screen with themed styling, win letters, level images with fallbacks, and navigation to next level or events.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing them in sessionStorage, and managing hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, screens, and enabling animation, typography, and container-query plugins.",
  "project_state.json": "Metadata describing project state, issues, and notes, including PWA installability problems on Android Chrome."
}