{
  "backend/main.mo": "Actor handling user profiles and per‑user game level states with access‑controlled queries and updates.",
  "feature_evidence.json": "Feature evidence report linking the skip‑button requirement to specific frontend files and components.",
  "frontend-file-summaries.txt": "Generated summaries describing responsibilities of all frontend files, including screens, hooks, assets, and level implementations.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing light/dark color palettes and global styles.",
  "frontend/index.html": "Root HTML file loading the React app with favicon and main script.",
  "frontend/src/App.tsx": "Main React app orchestrating password gate, event selection, gameplay flow, and per‑game progress handling.",
  "frontend/src/components/decor/RomanticDecor.tsx": "Decorative component rendering animated hearts, flowers, and teddies based on a chosen variant.",
  "frontend/src/components/layout/PortraitFrame.tsx": "Layout wrapper enforcing portrait view with optional romantic pattern and a Relock button.",
  "frontend/src/game/assets/uploadedImages.ts": "Image list and helper selecting per‑level images with game‑specific offsets.",
  "frontend/src/game/assets/winImageMapping.ts": "Re‑exports image utilities for backward compatibility.",
  "frontend/src/game/constants.ts": "Defines password, game IDs, total levels, storage keys, and helper for per‑game storage key generation.",
  "frontend/src/game/content/events.ts": "Defines the EventContent interface and a list of game and romantic events, plus a helper to fetch events by ID.",
  "frontend/src/game/content/levelHints.ts": "Provides short hint strings for levels 1–68, mapped by level number.",
  "frontend/src/game/content/loseMessages.ts": "Contains randomized lose messages and returns special messages for the Promises 100 game.",
  "frontend/src/game/content/winLetters.ts": "Defines win letters per level and integrates Promises 100 win-letter support.",
  "frontend/src/game/levels/impl/FixedPuzzleLevel.tsx": "Implements a configurable puzzle level with many interaction types, timers, drag logic, and auto-win/lose conditions.",
  "frontend/src/game/levels/impl/Level001.tsx": "A level where clicking the instruction wins and clicking the moving heart increments attempts and can cause a loss.",
  "frontend/src/game/levels/impl/Level002.tsx": "A drag-based level where pulling the sun down triggers night mode and wins.",
  "frontend/src/game/levels/impl/Level003.tsx": "A press-and-hold level requiring holding the letter for 1.5 seconds to open and win, with failed attempts leading to loss.",
  "frontend/src/game/levels/impl/levelConfigs.ts": "Defines LevelConfig type and a mapping of level numbers to their instructions, solution keys, and optional data for the default game.",
  "frontend/src/game/levels/levelRegistry.ts": "Selects the correct level component based on level number and game ID, routing either to default levels or Promises 100 levels.",
  "frontend/src/game/promises100/content/loseMessages.ts": "Provides an array of themed lose messages and a helper to return one at random.",
  "frontend/src/game/promises100/content/winLetters.ts": "Contains win-letter text and promises for each Promises 100 level as a numbered record.",
  "frontend/src/game/promises100/levels/levelConfigs.ts": "Defines Promises100LevelConfig and a full record of instructions, solutions, and optional data for all Promises 100 levels.",
  "frontend/src/game/promises100/levels/Promises100Level.tsx": "Implements interactive logic for Promises 100 levels, handling taps, holds, drags, waiting, and determining win/lose states.",
  "frontend/src/game/storage/passwordGate.ts": "Implements password checking and localStorage-based lock/unlock state handling.",
  "frontend/src/game/storage/progressStorage.ts": "Manages saving, loading, updating, and resetting player progress using localStorage.",
  "frontend/src/game/storage/useProgress.ts": "React hook managing game progress by loading, syncing, and updating level state with local storage and optional backend actor.",
  "frontend/src/game/ui/levelBackground.ts": "Generates dynamic per-level background gradients and accent colors based on game ID and level zones.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login flow, and state exposure to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile and game level state via the backend actor.",
  "frontend/src/index.css": "Global Tailwind-based styles defining color themes, dark mode variables, animations, and utility classes.",
  "frontend/src/main.tsx": "App entry point that mounts React, wrapping the app with query and identity providers.",
  "frontend/src/screens/EventDetailScreen.tsx": "Displays detailed romantic event content with photo and letter sections, including themed styling and navigation.",
  "frontend/src/screens/EventsHubScreen.tsx": "Renders a hub listing all events with styling, icons, and click handling, disabling gameplay events when needed.",
  "frontend/src/screens/IntroScreen.tsx": "Empty screen placeholder with no implemented content.",
  "frontend/src/screens/LandingScreen.tsx": "Displays a password entry screen with romantic styling and unlock logic that triggers onSuccess when validated.",
  "frontend/src/screens/LevelPlayScreen.tsx": "Loads and renders a level component with themed backgrounds, transition effects, and skip, win, or lose handling.",
  "frontend/src/screens/LoadingScreen.tsx": "Shows a timed loading animation with progress bar and triggers onComplete when finished.",
  "frontend/src/screens/LoseScreen.tsx": "Renders a themed loss screen with a random message, image, shake animation, and retry button.",
  "frontend/src/screens/PasswordGateScreen.tsx": "Empty screen placeholder with no implemented content.",
  "frontend/src/screens/WinScreen.tsx": "Displays a win screen with letter, image fallback system, romantic visuals, and navigation to next level or events.",
  "frontend/src/utils/urlParams.ts": "Utility helpers to read URL params (including hash routing), store/retrieve them in sessionStorage, and persist or clear values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, radii, screens, and loading several plugins.",
  "project_state.json": "Project state metadata describing implemented features and progress of a 100‑level puzzle game."
}