{
  "backend/main.mo": "Backend actor handling user profiles, access control, and per-user level-state saving and retrieval for three event types.",
  "feature_evidence.json": "Feature evidence listing two frontend updates related to header image replacement and static asset usage.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend components, assets, screens, and game logic modules.",
  "frontend/index.css": "Tailwind CSS base layer defining light/dark theme variables and global styling tokens.",
  "frontend/index.html": "HTML entrypoint setting up PWA metadata, icons, manifest links, and loading the main React bundle.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, display mode, and metadata.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and network‑first logic with IC call exclusions.",
  "frontend/src/App.tsx": "Main React app orchestrating password gate, event selection, gameplay flow, and service worker registration.",
  "frontend/src/components/decor/RomanticDecor.tsx": "UI component rendering floating heart, flower, and teddy decorations based on a chosen variant.",
  "frontend/src/components/layout/PortraitFrame.tsx": "Layout wrapper that applies a portrait frame with optional background pattern and optional PWA install banner.",
  "frontend/src/components/layout/PostUnlockHeader.tsx": "Romantic header component showing decorative background, glowing logo, hearts, and a subtitle after unlocking content.",
  "frontend/src/components/pwa/InstallBanner.tsx": "Floating PWA install banner that guides users to install the app or open a help dialog, with platform‑specific behavior.",
  "frontend/src/components/pwa/InstallHeartButton.tsx": "Heart‑shaped install button that triggers PWA install flow or shows help, with dismissal and iOS handling.",
  "frontend/src/components/pwa/InstallHelpDialog.tsx": "Dialog explaining installation steps for Android, iOS, and desktop using tabbed instructions.",
  "frontend/src/components/quiz/SecretLetterReveal.tsx": "Modal that reveals a secret letter with a themed animation and random image after user activates the reveal step.",
  "frontend/src/game/assets/uploadedImages.ts": "Defines the uploaded image list and functions to select images deterministically or randomly per level.",
  "frontend/src/game/assets/winImageMapping.ts": "Re‑exports image selection utilities from uploadedImages for game use.",
  "frontend/src/game/constants.ts": "Game constants including password, total levels, and storage key names for progress tracking.",
  "frontend/src/game/content/event3LoveLaughsJokes.ts": "Array of themed romantic jokes grouped by letters for in‑game content.",
  "frontend/src/game/content/events.ts": "Defines the EventContent interface and a list of event objects, plus a helper to fetch an event by id.",
  "frontend/src/game/content/levelHints.ts": "Provides a mapping of level numbers to hint strings for puzzle gameplay.",
  "frontend/src/game/content/loseMessages.ts": "Stores a set of lose messages and exports a function that returns one at random.",
  "frontend/src/game/content/winLetters.ts": "Defines WinLetter and provides love and promise letters for each completed level.",
  "frontend/src/game/levels/impl/FixedPuzzleLevel.tsx": "Implements a flexible puzzle level component handling many interaction types like dragging, waiting, tapping, and multi-step logic.",
  "frontend/src/game/levels/impl/Level001.tsx": "Implements a level where the heart moves when tapped and the user must tap the instruction text to win.",
  "frontend/src/game/levels/impl/Level002.tsx": "Implements a level where dragging the sun downward switches to night mode and triggers a win.",
  "frontend/src/game/levels/impl/Level003.tsx": "Implements a press‑and‑hold letter opening mechanic where holding long enough wins and short holds count as failed attempts.",
  "frontend/src/game/levels/impl/levelConfigs.ts": "Defines level configuration types and a map of level numbers to instructions, solutions, and optional data for levels 4–100.",
  "frontend/src/game/levels/levelRegistry.ts": "Maps level numbers to React components, using custom components for levels 1–3 and a wrapper using FixedPuzzleLevel for 4+.",
  "frontend/src/game/promisesKept/content/event4Levels.ts": "Provides full data definitions for 100 Promises Kept levels, including scenes, promises, actions, emoji hints, and detailed gameplay params.",
  "frontend/src/game/promisesKept/content/levelHints.ts": "Contains hint strings for Promises Kept levels, keyed by level number.",
  "frontend/src/game/promisesKept/content/loseMessages.ts": "Stores several randomized lose messages and exports a helper to retrieve one.",
  "frontend/src/game/promisesKept/content/winLetters.ts": "Defines love and promise letters for each Promises Kept level, keyed by level number.",
  "frontend/src/game/promisesKept/levels/impl/levelConfigs.ts": "Fetches event4 level data and adapts it into a PromisesKeptLevelConfig object.",
  "frontend/src/game/promisesKept/levels/impl/PromisesKeptPuzzleLevel.tsx": "React component implementing Promises Kept level logic with timers, animations, tap behaviors, and parameter‑driven win conditions.",
  "frontend/src/game/promisesKept/levels/levelRegistry.ts": "Returns a wrapper React component that loads PromisesKeptPuzzleLevel with the appropriate config for any level.",
  "frontend/src/game/quiz/constants.ts": "Defines fixed quiz parameters such as total levels, questions per level, and allowed wrong answers.",
  "frontend/src/game/quiz/content/quizLevels.ts": "Defines quiz levels with questions, options, and a secret letter for each level.",
  "frontend/src/game/quiz/types.ts": "Declares TypeScript interfaces for quiz options, questions, and levels.",
  "frontend/src/game/storage/passwordGate.ts": "Handles password validation and stores whether the password gate is unlocked in localStorage.",
  "frontend/src/game/storage/progressStorage.ts": "Manages main game progress in localStorage, including loading, saving, completing, skipping, and resetting levels.",
  "frontend/src/game/storage/promisesKeptProgressStorage.ts": "Tracks 'promises kept' progress similar to main progress storage but under a separate key.",
  "frontend/src/game/storage/quizProgressStorage.ts": "Stores and updates quiz-specific progress with localStorage-backed load, save, complete, skip, and reset functions.",
  "frontend/src/game/storage/useProgress.ts": "React hook syncing main progress between localStorage and backend actor, with helpers for completion, skipping, and resetting.",
  "frontend/src/game/storage/usePromisesKeptProgress.ts": "React hook for 'promises kept' progress, loading from backend when available and providing update helpers.",
  "frontend/src/game/storage/useQuizProgress.ts": "React hook managing quiz progress with backend syncing and local fallback behavior.",
  "frontend/src/game/ui/levelBackground.ts": "Generates per-level background styling based on level zones with gradients, accent colors, and overlay opacity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile and level state through the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers, color variables, dark mode styles, and custom animations/utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker and listens for updates to prompt reloads.",
  "frontend/src/pwa/usePwaInstall.ts": "Implements PWA installation logic, handling install prompts, iOS detection, and dismissal state.",
  "frontend/src/screens/EventDetailScreen.tsx": "Displays detailed romantic event content and routes to interactive event screens or a fallback letter view.",
  "frontend/src/screens/EventsHubScreen.tsx": "Renders a hub listing all events, showing game or letter types with icons and disabled states, and triggers onEventSelect when an event is clicked.",
  "frontend/src/screens/IntroScreen.tsx": "Empty file with no implementation.",
  "frontend/src/screens/LandingScreen.tsx": "Displays a password‑gate landing page with romantic visuals, validating input and calling onSuccess when the correct password is entered.",
  "frontend/src/screens/LevelPlayScreen.tsx": "Loads and renders a specific game level with hint toggling, skip support, and separate themes for two game types.",
  "frontend/src/screens/LoadingScreen.tsx": "Shows a loading animation with a progress bar that completes over time then calls onComplete.",
  "frontend/src/screens/LoseScreen.tsx": "Displays a themed lose screen using random messages, shaking animation, and a retry button, with separate styling for two game types.",
  "frontend/src/screens/PasswordGateScreen.tsx": "Empty file with no implementation.",
  "frontend/src/screens/QuizPlayScreen.tsx": "Implements multi‑level quiz gameplay with answer checking, progress tracking, loss handling, completion flow, and optional secret letter reveal.",
  "frontend/src/screens/romantic/DPBEventScreen.tsx": "Implements an event screen where repeated 'No' clicks cycle persuasive messages until 'Yes' triggers a celebration view with photos. Includes a hidden letter toggle and romantic decorations.",
  "frontend/src/screens/romantic/LoveLaughsEventScreen.tsx": "Displays 10 selectable joke-filled letters with images in a modal, using a dark romantic theme. Handles letter selection, modal display, and joke image retrieval.",
  "frontend/src/screens/romantic/TogetherForeverEventScreen.tsx": "Shows a persuasion-style event where the 'No' button moves randomly until 'Yes' triggers a celebration with photos and a letter. Uses romantic visuals and dynamic button positioning.",
  "frontend/src/screens/WinScreen.tsx": "Renders a win screen showing level completion, animated visuals, images with fallbacks, and next-level navigation. Includes a special romantic theme for event-4 with hearts, gradients, and a letter display.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL or session parameters, supporting both query and hash routing. Includes session persistence and hash parameter removal logic.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including fonts, colors, radii, screens, and plugins. Sets up dark mode, content paths, and custom color variables.",
  "project_state.json": "Defines the project state, including metadata, known build issues, existing features for header logo updates, and a pending request to replace the post-password events header logo."
}