{
  "backend/main.mo": "Motoko canister managing user profiles and per-event level states with access control checks for viewing and updating data.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme color variables and applying base styles.",
  "frontend/index.html": "Root HTML document configuring PWA metadata, icons, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, theme, icons, and startup behavior.",
  "frontend/public/sw.js": "Service worker implementing precaching, runtime caching, and network-first navigation handling.",
  "frontend/src/App.tsx": "Main React app controlling authentication, event selection, game routing, and service worker registration.",
  "frontend/src/components/decor/RomanticDecor.tsx": "UI component rendering floating hearts, flowers, or teddies as decorative background elements.",
  "frontend/src/components/layout/PortraitFrame.tsx": "Layout wrapper enforcing portrait-centered design with optional pattern background and install banner.",
  "frontend/src/components/layout/PostUnlockHeader.tsx": "Header component with romantic-themed background, logo, and heart-decorated title for post-unlock screens.",
  "frontend/src/components/pwa/InstallBanner.tsx": "PWA install banner that shows install options, iOS instructions, and a help dialog trigger.",
  "frontend/src/components/pwa/InstallHeartButton.tsx": "Heart-shaped floating install button that triggers PWA install or fallback help dialog.",
  "frontend/src/components/pwa/InstallHelpDialog.tsx": "Dialog with tabbed instructions for installing the PWA on Android, iOS, and desktop.",
  "frontend/src/components/quiz/SecretLetterReveal.tsx": "Modal flow that reveals a hidden romantic letter with a themed image after user confirmation.",
  "frontend/src/game/assets/uploadedImages.ts": "List of uploaded image filenames with helpers to pick deterministic or random images per level.",
  "frontend/src/game/assets/winImageMapping.ts": "Re-exports image-level mapping utilities for game win screens.",
  "frontend/src/game/constants.ts": "Game constants including password, level counts, and storage key names.",
  "frontend/src/game/content/event3LoveLaughsJokes.ts": "Array of humorous love-themed joke lines grouped into letters for event 3.",
  "frontend/src/game/content/events.ts": "Defines metadata for all events and provides a lookup function by event ID.",
  "frontend/src/game/content/levelHints.ts": "Provides a numbered map of short gameplay hints for each level.",
  "frontend/src/game/content/loseMessages.ts": "Contains an array of encouraging lose messages and a helper to return one at random.",
  "frontend/src/game/content/winLetters.ts": "Defines an interface and per‑level romantic love/promise letters returned on win.",
  "frontend/src/game/levels/impl/FixedPuzzleLevel.tsx": "Implements a large configurable puzzle level with drag, press, swipe, timer, and wait mechanics based on LevelConfig.",
  "frontend/src/game/levels/impl/Level001.tsx": "A level where the heart moves on click and the player must click the instruction text to win.",
  "frontend/src/game/levels/impl/Level002.tsx": "A drag‑based level where pulling the sun downward switches to night and triggers win.",
  "frontend/src/game/levels/impl/Level003.tsx": "A hold‑to‑open letter level requiring a 1.5s press, tracking attempts and triggering win on success.",
  "frontend/src/game/levels/impl/levelConfigs.ts": "Defines LevelConfig type and a large map of level numbers to instructions, solution types, and optional data for levels 4–100.",
  "frontend/src/game/levels/levelRegistry.ts": "Maps level numbers to React components, using FixedPuzzleLevel with configs for levels above 3.",
  "frontend/src/game/promisesKept/content/event4Levels.ts": "Contains full data definitions for 100 'Promises Kept' levels, including scenes, promises, actions, hints, and parameters.",
  "frontend/src/game/promisesKept/content/levelHints.ts": "Provides textual hint strings for each Promises Kept level keyed by level number.",
  "frontend/src/game/promisesKept/content/loseMessages.ts": "Stores multiple randomized lose messages and exports a function to retrieve one.",
  "frontend/src/game/promisesKept/content/winLetters.ts": "Defines love and promise letters awarded per level and exports them as a numbered record.",
  "frontend/src/game/promisesKept/levels/impl/levelConfigs.ts": "Converts event level data into PromisesKeptLevelConfig objects with default fallback.",
  "frontend/src/game/promisesKept/levels/impl/PromisesKeptPuzzleLevel.tsx": "React component implementing interactive logic for Promises Kept levels driven by config parameters.",
  "frontend/src/game/promisesKept/levels/levelRegistry.ts": "Returns a wrapped PromisesKeptPuzzleLevel component for any level using its config.",
  "frontend/src/game/quiz/constants.ts": "Defines quiz game constants for total levels, questions per level, and allowed mistakes.",
  "frontend/src/game/quiz/content/quizLevels.ts": "Defines quiz levels with questions, options, and secret messages for each level.",
  "frontend/src/game/quiz/types.ts": "Declares TypeScript interfaces for quiz options, questions, and level structure.",
  "frontend/src/game/storage/passwordGate.ts": "Provides functions to check, unlock, and manage password-gated access using localStorage.",
  "frontend/src/game/storage/progressStorage.ts": "Handles saving, loading, and updating level progress in localStorage for the main game.",
  "frontend/src/game/storage/promisesKeptProgressStorage.ts": "Manages progress storage for the 'Promises Kept' mode, including completion and level advancement logic.",
  "frontend/src/game/storage/quizProgressStorage.ts": "Stores and updates quiz mode progress, tracking completed and unlocked quiz levels.",
  "frontend/src/game/storage/useProgress.ts": "React hook that syncs game progress with backend and localStorage while exposing helpers for level handling.",
  "frontend/src/game/storage/usePromisesKeptProgress.ts": "React hook for 'Promises Kept' progress, syncing with backend and clamping levels to valid ranges.",
  "frontend/src/game/storage/useQuizProgress.ts": "React hook managing quiz progress with backend sync and level locking rules.",
  "frontend/src/game/ui/levelBackground.ts": "Generates background gradients and accent colors for levels based on themed color zones.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading, logging in, clearing identity, and exposing login status through a React provider.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for fetching and mutating user profiles and level state.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode settings, and custom animations and utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on load and logs update availability.",
  "frontend/src/pwa/usePwaInstall.ts": "Manages PWA install prompts, tracking installability, dismissal, and standalone state.",
  "frontend/src/screens/EventDetailScreen.tsx": "Displays romantic event details, routing to interactive screens or rendering a static fallback letter view.",
  "frontend/src/screens/EventsHubScreen.tsx": "Displays a list of interactive events and mini‑games, handling disabled states and navigation when an event is selected.",
  "frontend/src/screens/IntroScreen.tsx": "Empty file with no implemented content.",
  "frontend/src/screens/LandingScreen.tsx": "Renders a password‑protected landing page with romantic theming, unlocking the app when the correct password is entered.",
  "frontend/src/screens/LevelPlayScreen.tsx": "Runs gameplay for level-based events, loading the correct level component, showing hints, and handling win/lose/skip actions with themed UI per event type.",
  "frontend/src/screens/LoadingScreen.tsx": "Shows a heart‑themed loading animation with a timed progress bar and triggers completion when done.",
  "frontend/src/screens/LoseScreen.tsx": "Displays a themed lose screen for two game modes, showing a random message and a retry button with animation effects.",
  "frontend/src/screens/PasswordGateScreen.tsx": "Empty file with no implemented content.",
  "frontend/src/screens/QuizPlayScreen.tsx": "Implements a multi‑level quiz system with questions, progress tracking, wrong‑answer limits, level completion, and secret letter reveals.",
  "frontend/src/screens/romantic/DPBEventScreen.tsx": "Romantic event screen where repeated 'No' clicks cycle messages and 'Yes' triggers a celebration with photos and a hidden letter.",
  "frontend/src/screens/romantic/LoveLaughsEventScreen.tsx": "Allows selecting one of 10 joke-filled letters, showing jokes in a modal with associated images.",
  "frontend/src/screens/romantic/TogetherForeverEventScreen.tsx": "'No' button moves unpredictably on each click and 'Yes' leads to a celebration with photos and themed letter.",
  "frontend/src/screens/WinScreen.tsx": "Win screen with animated transition, fallback images, and different layouts for normal levels and Promises Kept event.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL params and session-stored params.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with extended colors, fonts, radii, screens, and plugins.",
  "project_state.json": "Metadata describing project state, known issues, and pending feature requests for install button and level progression fixes."
}